ArtshareAPI/app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user].permit(:name, :email))
    if @user.save
---
INSERT INTO "users" ("name", "email") VALUES ($1, $2) RETURNING "id"  [["name", "'Kelly'"], ["email", "'Hashbrownemail'"]]

  def update
    if @user = User.find_by(id: params[:id])
      @user.update_attributes(post_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2 WHERE "users"."id" = $3  [["name", "Tom "], ["email", "hashbrowntwo "], ["id", 3]]

  def destroy
    if @user = User.find_by(id: params[:id])
      render json: @user
      @user.delete
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]